In [7]:
a=input()
col=["red","green","blue"]
if a not in col:
     print("not primary color")
else:
     print("primary color")

yfyf
not primary color

In [8]:
!pip3 install pandas

Requirement already satisfied: pandas in /home/placement/anaconda3/lib/python3.10/site-packages (1.5.3)
Requirement already satisfied: python-dateutil>=2.8.1 in /home/placement/anaconda3/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /home/placement/anaconda3/lib/python3.10/site-packages (from pandas) (2022.7)
Requirement already satisfied: numpy>=1.21.0 in /home/placement/anaconda3/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /home/placement/anaconda3/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [9]:
!pip3 install numpy

Requirement already satisfied: numpy in /home/placement/anaconda3/lib/python3.10/site-packages (1.23.5)

In [10]:
import pandas as pd

In [11]:
data=pd.read_csv("/home/placement/Desktop/venkatesh/doc.txt")

In [12]:
data.describe()

           srno        pincode       marks
count  5.000000       5.000000    5.000000
mean   3.000000  533659.200000  366.200000
std    1.581139     571.845871   28.208155
min    1.000000  533233.000000  327.000000
25%    2.000000  533242.000000  350.000000
50%    3.000000  533251.000000  375.000000
75%    4.000000  534250.000000  379.000000
max    5.000000  534320.000000  400.000000

In [13]:
data.head()

   srno    name  pincode         city branch  marks
0     1  satish   534250      palakol     it    379
1     2   mouli   533251        lanka    ece    350
2     3    raja   533242       razole   mech    400
3     4    yesh   534320    penugonda   aiml    375
4     5  chaitu   533233  ravulapalem    cse    327

In [14]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   srno     5 non-null      int64
 1   name     5 non-null      object
 2   pincode  5 non-null      int64
 3   city     5 non-null      object
 4   branch   5 non-null      object
 5   marks    5 non-null      int64
dtypes: int64(3), object(3)
memory usage: 368.0+ bytes

In [15]:
data.tail(3)

   srno    name  pincode         city branch  marks
2     3    raja   533242       razole   mech    400
3     4    yesh   534320    penugonda   aiml    375
4     5  chaitu   533233  ravulapalem    cse    327

In [16]:
data["name"].unique()

array(['satish', 'mouli', 'raja', 'yesh', 'chaitu'], dtype=object)